app/views/messages/_show.html.erb

SELECT  "bookings".* FROM "bookings" WHERE "bookings"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
---
      <% if current_user == message.booking.activity.seller %>
      <%= message.booking.activity.seller.first_name %>