app/controllers/seller/activities_controller.rb

  def index
    @activities = policy_scope(current_user.activities)

    @markers = @activities.map do |activity|
---
SELECT "activities".* FROM "activities" WHERE "activities"."seller_id" = $1  [["seller_id", 23]]

  def show
    @activity = Activity.find(params[:id])
---
SELECT  "activities".* FROM "activities" WHERE "activities"."id" = $1 LIMIT $2  [["id", 29], ["LIMIT", 1]]

  def destroy
    @activity = Activity.find(params[:id])
    authorize @activity
    @activity.destroy
---
SELECT  "activities".* FROM "activities" WHERE "activities"."id" = $1 LIMIT $2  [["id", 46], ["LIMIT", 1]]
DELETE FROM "activities" WHERE "activities"."id" = $1  [["id", 47]]