app/controllers/seller/bookings_controller.rb

SELECT bookings.* FROM "bookings" INNER JOIN "activities" ON "activities"."id" = "bookings"."activity_id" WHERE "activities"."seller_id" = $1  [["seller_id", 21]]
---
  def index
    @bookings = policy_scope(Booking.select('bookings.*')
      .joins(:activity)
      .where(activities: { seller: current_user }))

SELECT  "bookings".* FROM "bookings" WHERE "bookings"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "bookings" SET "status" = $1, "updated_at" = $2 WHERE "bookings"."id" = $3  [["status", "accepted"], ["updated_at", "2019-09-14 23:07:52.627329"], ["id", 2]]
---
  def confirmed
    @booking = Booking.find(params[:id])
    @booking.status = "accepted"
    authorize @booking
    if @booking.save