app/views/seller/activities/show.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."activity_id" = $1  [["activity_id", 4]]
SELECT AVG("reviews"."rating") FROM "reviews" WHERE "reviews"."activity_id" = $1  [["activity_id", 2]]
---
        <% if @activity.reviews != [] %>
            <% Review.where(activity: @activity).average(:rating).round.times do  %>

SELECT COUNT(*) FROM "reviews" WHERE "reviews"."activity_id" = $1  [["activity_id", 2]]
---

        (<%= @activity.reviews.count %>)

SELECT  1 AS one FROM "reviews" WHERE "reviews"."activity_id" = $1 LIMIT $2  [["activity_id", 4], ["LIMIT", 1]]
SELECT AVG("reviews"."rating") FROM "reviews" WHERE "reviews"."activity_id" = $1  [["activity_id", 2]]
---
            </div>
            <% if !Review.where(activity: @activity).empty? %>
            <% Review.where(activity: @activity).average(:rating).round.times do  %>

SELECT COUNT(*) FROM "reviews" WHERE "reviews"."activity_id" = $1  [["activity_id", 2]]
---
            <% end %>
            (<%= @activity.reviews.count %>)

SELECT "reviews".* FROM "reviews" WHERE "reviews"."activity_id" = $1  [["activity_id", 46]]
---
      <div class="cards-reviews">
        <% @activity.reviews.each do |review| %>