app/views/seller/activities/show.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."activity_id" = $1  [["activity_id", 2]]
---
<div class="cards-reviews mt-4">
<% @activity.reviews.each do |review| %>