app/controllers/activities_controller.rb

  def index
    @activities = Activity.where.not(latitude: nil, longitude: nil)

    @markers = @activities.map do |activity|
---
SELECT "activities".* FROM "activities" WHERE "activities"."latitude" IS NOT NULL AND "activities"."longitude" IS NOT NULL

  def create
    @activity = Activity.new(activity_params)
    @activity.seller = current_user
    authorize @activity
    if @activity.save
---
INSERT INTO "activities" ("name", "address", "type_activity", "price", "description", "max_participants", "seller_id", "start_date", "end_date", "created_at", "updated_at", "latitude", "longitude", "photo") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"