app/controllers/bookings_controller.rb

SELECT "bookings".* FROM "bookings" WHERE "bookings"."user_id" = $1 ORDER BY "bookings"."created_at" DESC  [["user_id", 26]]
---
  def index
    @bookings = policy_scope(current_user.bookings).order(created_at: :desc)

SELECT  "activities".* FROM "activities" WHERE "activities"."id" = $1 LIMIT $2  [["id", 44], ["LIMIT", 1]]
INSERT INTO "bookings" ("date", "total_price", "participants_number", "user_id", "activity_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @activity = Activity.find(params[:activity_id])
    @booking = Booking.new(params_booking)
    authorize @booking
    @booking.activity = @activity
    @booking.user = current_user
    @booking.total_price = params[:booking][:participants_number].to_i * @activity.price
    if @booking.save