app/controllers/messages_controller.rb

SELECT  "bookings".* FROM "bookings" WHERE "bookings"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
SELECT "messages".* FROM "messages" WHERE "messages"."booking_id" = $1  [["booking_id", 11]]
---
  def new
    @booking = Booking.find(params[:booking_id])
    @message = Message.new
    authorize @message
    @messages = Message.where(booking: @booking)

SELECT  "bookings".* FROM "bookings" WHERE "bookings"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
INSERT INTO "messages" ("content", "sender_id", "receiver_id", "booking_id", "created_at", "updated_at", "date") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @messages = Message.where(booking: @booking)
    @booking = Booking.find(params[:booking_id])
    @message = Message.new(message_params)
    authorize @message
    @message.sender = current_user
    @message.booking = @booking
    @message.date = Date.today
    if @booking.user == current_user
      @message.receiver = @booking.activity.seller
    else
      @message.receiver = @booking.user
    end

    if @message.save