app/controllers/reviews_controller.rb

  def create
    @activity = Activity.find(params[:activity_id])
    @review = Review.new(review_params)
    authorize @review
    @review.activity = @activity
    if @review.save
---
SELECT  "activities".* FROM "activities" WHERE "activities"."id" = $1 LIMIT $2  [["id", 44], ["LIMIT", 1]]
INSERT INTO "reviews" ("content", "rating", "activity_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "sddsd"], ["rating", 2], ["activity_id", 44], ["created_at", "2019-07-16 20:16:13.494797"], ["updated_at", "2019-07-16 20:16:13.494797"]]