app/views/activities/show.html.erb

        </div>
        <% if !Review.where(activity: @activity).empty? %>
        <% Review.where(activity: @activity).average(:rating).round.times do  %>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."activity_id" = $1  [["activity_id", 45]]
SELECT  1 AS one FROM "reviews" WHERE "reviews"."activity_id" = $1 LIMIT $2  [["activity_id", 28], ["LIMIT", 1]]
SELECT AVG("reviews"."rating") FROM "reviews" WHERE "reviews"."activity_id" = $1  [["activity_id", 28]]

        <% end %>
        (<%= @activity.reviews.count %>)
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."activity_id" = $1  [["activity_id", 45]]
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."activity_id" = $1  [["activity_id", 28]]

<div class="cards-reviews">
  <% @activity.reviews.each do |review| %>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."activity_id" = $1  [["activity_id", 2]]