app/views/activities/show.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."activity_id" = $1  [["activity_id", 1]]
---
<div class="cards-reviews">
<% @activity.reviews.each do |review| %>